{
  "event": "Dent Maui 2025 Collaboration Weekend",
  "dates": "December 5-7, 2025",
  "attendees": [
    {
      "name": "Andrea Brado",
      "linkedin": "linkedin.com/in/andrea-brado-2a4283171",
      "bio": "Andrea Brado is Director of Operations at Atlas Networks, where she oversees day-to-day systems, cross-department coordination, and process improvements. Her background includes program management and operations experience."
    },
    {
      "name": "Steve Broback",
      "linkedin": "linkedin.com/in/stevebroback",
      "bio": "Steve Broback is the cofounder of Dent The Future and has worked in technology conferences and community building for more than two decades. His earlier companies include Thunder Lizard Productions and the Parnassus Group."
    },
    {
      "name": "Morgan Johnson",
      "linkedin": "linkedin.com/in/amorganjohnson",
      "bio": "Morgan Johnson is Partner and Chief Experience Officer at Experiences For Mankind. She focuses on client operations, team leadership, and structured approaches to marketing and creative work. Morgan also serves on the Dent board."
    },
    {
      "name": "Karen Tritt Kolnes",
      "linkedin": "linkedin.com/in/karenkolnes",
      "bio": "Karen Kolnes is an executive recruiter working across commercial real estate, retail, healthcare, and nonprofit leadership roles. She has extensive experience in talent acquisition and search strategy and is active with Social Venture Partners San Diego."
    },
    {
      "name": "Michael Lee",
      "linkedin": "linkedin.com/in/seattlemichaellee",
      "bio": "Michael Lee is a John Maxwell Leadership Certified speaker, trainer, and coach. He previously ran Express Employment Professionals Seattle and has worked in recruiting, staffing, and business development."
    },
    {
      "name": "Ryan Maloney",
      "linkedin": "linkedin.com/in/ryanmaloney",
      "bio": "Ryan Maloney is the founder and CEO of Atlas Networks, a Seattle-based ISP. His career includes data-center design, networking, and leadership roles in telecom and hosting companies."
    },
    {
      "name": "Asa Mathat",
      "linkedin": "linkedin.com/in/asamathat",
      "bio": "Asa Mathat is a photographer and founder of the ASA Foundation. His work spans editorial and commercial photography as well as nonprofit programs centered on youth engagement and creative expression."
    },
    {
      "name": "Ydriss Nouara",
      "linkedin": null,
      "bio": "Ydriss Nouara is known for his documented experience as a survivor of the 2023 Lahaina wildfire. At the time he was living and working in Lahaina and later contributed firsthand accounts featured in national reporting."
    },
    {
      "name": "Elena Petrova",
      "linkedin": "linkedin.com/in/lena-petrova-toolsie",
      "bio": "Elena Petrova is the founder and CEO of Ad Astra Inc., a language-access services firm supporting government, healthcare, and community organizations. She also developed AdAstraConnect, a platform for managing language-service workflows."
    },
    {
      "name": "Jason Preston",
      "linkedin": "linkedin.com/in/jpreston",
      "bio": "Jason Preston is a partner at Alsop Louie Partners and TK MediaTech Ventures, investing in technology and media. He is also the cofounder of Dent and teaches teamwork and leadership at the University of Washington."
    },
    {
      "name": "Sonia J. Rowley, Ph.D.",
      "linkedin": "linkedin.com/in/soniajrowley",
      "bio": "Dr. Sonia Rowley is a marine biologist whose work focuses on deep-reef and mesophotic gorgonian corals. She conducts field and evolutionary research and holds roles with the University of Hawaiʻi, the Smithsonian, and the Natural History Museum in London."
    },
    {
      "name": "Scott Tritt",
      "linkedin": null,
      "website": "amplified.org/pr/tritt/scott",
      "bio": "Scott Tritt previously worked in television news production and now contributes to nonprofit and philanthropic advisory work through Amplified Impact Partners, with a focus on outcome-centered storytelling and organizational support."
    },
    {
      "name": "Stewart Ugelow",
      "linkedin": "linkedin.com/in/ugelow",
      "bio": "Stewart Ugelow is an entrepreneur and consultant who advises startups on strategy, business development, and product direction. His background spans consumer products, digital tools, nonprofits, and earlier reporting work at major newspapers."
    },
    {
      "name": "Gary Ware",
      "linkedin": "linkedin.com/in/garyware",
      "bio": "Gary Ware is a corporate facilitator and the founder of Breakthrough Play, where he uses improv-based and experiential methods to help teams strengthen communication, creativity, and collaboration. His background includes digital-media roles, coaching, and long-standing involvement in the improv community."
    }
  ]
}
